Repository: vermont42/Conjugar
Catalog: Conjugar/Supporting/Localizable.xcstrings
Source language: en
Languages: es

# Info.questionsAndAnswersHeading
source: Questions & Answers
es: Preguntas y Respuestas

# Info.questionsAndAnswersText
source: ~Q:~ How can I contact the developer of ~Conjugar~? ~A:~ Email vermontcoder@gmail.com. ~Q:~ There is a verb missing from the ~Browse~ list. What gives? ~A:~ ~Conjugar~'s goal is to teach Spanish-verb conjugation, not to serve as a dictionary. ~SpanishDict.com~ and ~Spanish Verbs Made Simple(r)~ are better choices if you seek exhaustivity. That said, feel free to email ~Conjugar's~ developer at vermontcoder@gmail.com if you would like to see a verb added. ~Q:~ Why does ~Conjugar~ use Spanish names for tenses rather than English, for example, %presente de indicativo% rather than "present indicative"? ~A:~ Admittedly, English tense names would perhaps be more approachable for the learner in certain cases, for example, %raíz futura%. English speakers might better understand the term "future stem". But perhaps because of his years working as a lawyer and software developer, ~Conjugar~'s developer values precision in language. English tense names are imprecise when applied to Spanish tenses. For example, the English "gerund" can act as an adjective, but the Spanish %gerundio% cannot. "Gerund" is, in that sense, inaccurate when applied to the %gerundio%. The same goes for other English tense names and Spanish tenses, to varying degrees. ~Q:~ I've seen the terms "mood" and "aspect" in descriptions of verb tenses, but ~Conjugar~ does not use these terms. Also, the %participio%, %gerundio%, and %raíz futura% are not really tenses. ~A:~ Was that a question? You are correct that ~Conjugar~ does not use these two terms, and those three things are not usually described as "tenses". With respect to terminology, bear in mind that ~Conjugar~'s purpose is to teach Spanish-verb conjugation, not to teach English Spanish-verb-conjugation nomenclature. With respect to the participio, gerundio, and raíz futura, ~Conjugar~'s developer does consider those three things to be tenses, if "tense" is taken to mean "a systematic way of changing verbs for a specific purpose". This definition, though absent, on information and belief, from any dictionary, serves ~Conjugar~'s pedagogical purpose well enough. ~Q:~ Why is Conjugar free? ~A:~ The developer's goals in creating ~Conjugar~ were to learn Spanish-verb conjugation and a software-development technique, programmatic layout, not to earn a living. That said, money is useful, and the developer will implement a tip jar or some other type of in-app purchase if download numbers justify the effort.
es: ~P:~ ¿Cómo puedo contactar con el desarrollador de ~Conjugar~? ~R:~ Envíale un correo electrónico al desarrollador: vermontcoder@gmail.com ~P:~ Falta un verbo en la lista de ~Explorar~. ¿Por qué? ~R:~ El objetivo de ~Conjugar~ es enseñar la conjugación de los verbos españoles, no servir de diccionario. Si buscas un inventario de verbos completo, ~SpanishDict.com~ y ~Spanish Verbs Made Simple(r)~ son mejores opciones. Dicho esto, no dudes en enviarle un correo electrónico al desarrollador de ~Conjugar~ a vermontcoder@gmail.com si deseas que aparezca un verbo en concreto. ~P:~ ¿Por qué ~Conjugar~ usa nombres en español para los tiempos verbales en lugar de en inglés (por ejemplo, %presente de indicativo% en lugar de "present indicative")? ~R:~ Es cierto que los nombres verbales del inglés quizás sean más fáciles de entender para el alumno en ciertos casos, como por ejemplo, el de %raíz futura%. Los angloparlantes podrían entender mejor el término "future stem", pero quizás debido a sus años trabajando como abogado y desarrollador de software, el desarrollador de ~Conjugar~ valora la precisión en el lenguaje. Los nombres de los tiempos en inglés son imprecisos cuando se aplican a los tiempos en español. Por ejemplo, el "gerund" inglés puede actuar como un adjetivo, pero no el %gerundio% español. En ese sentido, el término "gerund" es inexacto cuando se emplea para referirse al %gerundio%. Lo mismo ocurre con otros nombres en inglés y otros tiempos del español, en diversos grados. ~P:~ He visto los términos "modo" y "aspecto" en las descripciones de los tiempos verbales, pero ~Conjugar~ no usa estos términos. Además, %participio%, %gerundio% y %raíz futura% no son realmente tiempos verbales. ~R:~ ¿Es una pregunta? Tienes razón. ~Conjugar~ no usa estos dos términos, y esas tres cosas normalmente no se describen como "tiempos". Sobre los nombres usados para nombrarlos, ten en cuenta que el propósito de ~Conjugar~ es enseñar las conjugaciones de los verbos del español, no enseñar los nombres de las conjugaciones de los verbos españoles en inglés. Y con respecto al participio, gerundio y raíz futura, el desarrollador de ~Conjugar~ considera que estas tres cosas son tiempos verbales, si se considera que "tiempo" significa "una forma sistemática de cambiar verbos para un propósito específico". Esta definición, aunque no es la habitual en los diccionarios, desde el humilde punto de vista del desarrollador de ~Conjugar~, contribuye bastante bien al propósito pedagógico de ~Conjugar~. ~P:~ ¿Cómo es que ~Conjugar~ es gratis? ~R:~ Los objetivos que tenía el desarrollador al crear ~Conjugar~ eran aprender la conjugación de los verbos del español y practicar diseño programático (una técnica de desarrollo de software), no ganarse la vida. Dicho esto, el dinero es útil, y el desarrollador añadirá un tarro de propinas o algún tipo de compra integrada en la aplicación si el número de descargas justifica el esfuerzo.

# Info.raizFuturaText
source: ^Uses^ The ~raíz futura~ forms of verbs are used as stems for the %condicional% and %futuro de indicativo% tenses. Tap those tenses for descriptions of them. ^Form^ For all but twelve verbs, the raíz futura is identical to the infinitivo. For example, the raíz futura form of ~bailar~ is "bailar-". The following verbs have irregular raíz futura forms: caber: $cabR$- decir: $dIR$- haber: $habR$- hacer: $haR$- poder: $podR$- poner: $ponDr$- querer: $querR$- saber: $sabR$- salir: $salDr$- tener: $tenDr$- valer: $valDr$- venir: $venDr$-
es: ^Usos^ Las formas de verbos con ~raíz futura~ se usan como derivaciones para los tiempos %condicional% y %futuro de indicativo%. Toca esos tiempos para obtener descripciones de ellos. ^Forma^ Para todos los verbos excepto doce, la raíz futura es idéntica a la forma del infinitivo. Por ejemplo, la raíz futura de ~bailar~ es "bailar-". Los siguientes verbos tienen formas de raíz futura irregulares: caber: $cabR$- decir: $dIR$- haber: $habR$- hacer: $haR$- poder: $podR$- poner: $ponDr$- querer: $querR$- saber: $sabR$- salir: $salDr$- tener: $tenDr$- valer: $valDr$- venir: $venDr$-

# Info.terminologyHeading
source: Terminology
es: Terminología

# Info.terminologyText
source: ^Verb^ A ~verb~ is a kind of word that represents an action in a sentence. In the sentence "Celina Zambon dances the flamenco", "to dance" is the verb. Verb ~tense~s express, among other things, temporality. In the example sentence, the verb tense could express that the action is currently taking place. (That said, "is dancing" would specify this more precisely.) In English, to a limited degree, and in Spanish, to a near-total degree, the ~subject~ or actor in the sentence, combined with the tense, determines the exact form of the verb used. This is the verb ~conjugation~. In English, the example sentence's combination of subject and tense results in the conjugation "dances". The ~infinitivo~ is an invariant form of the verb that ends in -ar, -er, or -ir. The ~infinitivo~ does not indicate time, number, or person. "Bailar" is an infinitivo that means "to dance". Spanish dictionaries and ~Conjugar~'s Browse tab list the infinitivo forms of verbs. The ~verb stem~ is the inifinitivo minus the -ar, -ir, or -er ending. ^Pronoun^ A subject ~pronoun~ is a word that stands in for a subject. In English, the subject pronouns are ~I~, ~you~, ~he/she/it~, ~we~, ~y'all~, and ~they~. In both English and Spanish, subject pronouns have the ~singular~ or ~plural~ number. They are also ~first person~, ~second person~, or ~third person~. English subject pronouns correspond to the following person/number combinations: first person, singular: ~I~ second person, singular: ~you~ third person, singular: ~he/she/it~ first person, plural: ~we~ second person, plural: ~y'all~ third person, plural: ~they~ The first- and third-person subject pronouns in Spanish are straightforward for English-speakers: first person, singular: ~yo~ third person, singular: ~él~ (masc.)/~ella~ (fem.) first person, plural: ~nosotros~ (masc.)/~nosotras~ (fem.) third person, plural: ~ellos~ (masc.)/~ellas~ (fem.) "Fem." means that a pronoun refers to female subjects, and "masc." means that a pronoun refers to male subjects. The second-person subject pronouns in Spanish are more complicated in that they encode two formality levels, formal and informal. Further, uses of these pronouns differ between Spain and Latin America. ~Spain~ second person, singular, informal: ~tú~ second person, singular, formal: ~usted~ second person, plural, informal: ~vosotros~ (masc.)/~vosotras~ (fem.) second person, plural, formal: ~ustedes~ ~Much of Latin America~ second person, singular, informal: ~tú~ second person, singular, formal: ~usted~ second person, plural, informal: ~ustedes~ second person, plural, formal: ~ustedes~ Usted and ustedes use the él and ellos conjugations, respectively. The difference between the two regions is that ~ustedes~ has replaced ~vosotros~/~vosotras~ in Latin America. This replacement means that Spanish-learners in Spain must learn conjugations for six person-number combinations, but Spanish-learners in Latin America must learn conjugations for only five. In parts of Latin America, ~vos~ has replaced ~tú~ and uses different conjugations. This phenomenon is called %voseo%. Tap the blue word for a description of this phenomenon. ^Order and Presentation of Conjugations^ Treatises on Spanish verbs, when presenting the conjugations for a particular tense, present the conjugations in the following subject-pronoun order: yo, tú, él, nosotros, vosotros, ellos. In the interests of clarity and brevity, ~Conjugar~ does the same. For example, ~Conjugar~ would present the %presente de indicativo% conjugations of ~ser~ as follows: $soY$, $ERes$, $ES$, $sOmos$, $sOis$, $sOn$ Red letters in conjugations represent irregularities. A verb is considered irregular if any of its conjugations differs from the conjugation of a regular ~ar~, ~ir~, or ~er~ verb.
es: ^Verbo^ Un ~verbo~ es un tipo de palabra que representa una acción en una oración. En la oración "Celina Zambon baila el flamenco", "bailar" es el verbo. Los tiempos verbales expresan, entre otras cosas, cuándo se realiza la acción. En la oración de ejemplo, el tiempo verbal expresa que la acción se está llevando a cabo ahora mismo. En español, el ~sujeto~ o actor en la oración determina la forma exacta del verbo utilizado junto con el tiempo verbal en práticamente todos los casos. Este es la ~conjugación~ del verbo. En español, la combinación de sujeto y tiempo de la oración de ejemplo da como resultado la conjugación "baila". El ~infinitivo~ es un forma invariable del verbo que termina en -ar, -er o -ir. No indica tiempo, número ni persona. "Bailar" es un ejemplo de infinitivo. Los diccionarios de español y la pestaña Explorar de ~Conjugar~ presentan los verbos con sus formas en infinitivo. La ~raíz del verbo~ es el inifinitivo sin la terminación -ar, -ir o -er. ^Pronombre^ Un ~pronombre~ personal es una palabra que representa a un sujeto. En español, los pronombres personales que pueden actuar como sujetos son ~yo~, ~tú~, ~vos~, ~usted~, ~él~/~ella~, ~nosotros~/~nosotras~, ~vosotras~/~vosotros~, ~ustedes~ y ~ellas~/~ellos~. Tanto en español como en inglés, los pronombres de sujeto pueden tener el número ~singular~ o ~plural~. También pueden ser de ~primera persona~, ~segunda persona~ o ~tercera persona~. Estos son los pronombres personales del español, incluyendo las combinaciones de persona y número: primera persona, singular: ~yo~ segunda persona, singular: ~tú~ / ~vos~ / ~usted~ tercera persona, singular: ~él~ / ~ella~ primera persona, plural: ~nosotras~ / ~nosotros~ segunda persona, plural: ~vosotras~ / ~vosotros~ / ~ustedes~ tercera persona, plural: ~ellos~ / ~ellas~ Los pronombres de sujeto en segunda persona del español son complicados porque expresan dos niveles de formalidad, formal y informal. Además, los usos de estos pronombres en España y América Latina son muy diferentes. "Vosotros" solo se usa en España, y "vos" solo se usa en algunas partes de América Latina. ~España~ segunda persona, singular, informal: ~tú~ segunda persona, singular, formal: ~usted~ segunda persona, plural, informal: ~vosotros~ / ~vosotras~ segunda persona, plural, formal: ~ustedes~ ~Algunas Regiones de América Latina (p.ej., Argentina)~ segunda persona, singular, informal: ~vos~ segunda persona, singular, formal: ~usted~ segunda persona, plural, informal: ~ustedes~ segunda persona, plural, formal: ~ustedes~ ~Otra Regiones de América Latina (p.ej., Peru)~ segunda persona, singular, informal: ~tú~ segunda persona, singular, formal: ~usted~ segunda persona, plural, informal: ~ustedes~ segunda persona, plural, formal: ~ustedes~ Usted y ustedes usan las conjugaciones de él y ellos, respectivamente. ~Ustedes~ sustituye a ~vosotros~ / ~vosotras~ en América Latina. De este modo, los estudiantes de español deben aprender seis formas verbales cuando estudian las conjugaciones en España, pero en América Latina deben aprender solo cinco formas verbales. Como ya hemos dicho, en algunas regiones de América Latina, ~vos~ susituye a ~tú~ y usa diferentes conjugaciones. Este fenómeno se llama %voseo%. Toca la palabra en azul para leer una descripción de este fenómeno. ^Orden y Presentación de Conjugaciones^ Los tratados sobre verbos españoles presentan las conjugaciones en el siguiente orden de sujeto y pronombre: yo, tú, él, nosotros, vosotros, ellos. Para una mayor claridad y brevedad, ~Conjugar~ hace lo mismo. Por ejemplo, ~Conjugar~ presenta las conjugaciones %presente de indicativo% de ~ser~ de la siguiente manera: $soY$, $ERes$, $ES$, $sOmos$, $sOis$, $sOn$ Las letras en rojo de las conjugaciones señalan las formas irregulares. Un verbo se considera irregular si alguna de sus formas es diferente de las que emplea un verbo regular ~ar~, ~ir~ o ~er~.

# Info.voseoText
source: ^Background^ In certain parts of Latin America, when addressing one person informally, Spanish speakers use the pronoun ~vos~ and its conjugations instead of the pronoun ~tú~ and its conjugations. This phenomenon, ~voseo~, is ubiquitous in Argentina and occurs, to varying degrees, in all of Latin America except in Dominican Republic and Puerto Rico. Unfortunately, ~vos~ conjugations vary by country and region, complicating matters for the Spanish-learner, but the Real Academia Española (RAE), an authority on the Spanish language, provides model conjugations. These conjugations have some value because a Spanish-speaker from Medellín, Colombia reported to ~Conjugar~'s developer that he uses them. For the sake of expediency, ~Conjugar~ adopts the RAE’s ~vos~ conjugations. ^Conjugation^ ~Vos~ conjugations broadly resemble those of ~tú~ and, to a lesser extent, ~vosotros~. In the %presente de indicativo%, the endings are -ás, -ís, and -és for regular AR, IR, and ER verbs, respectively. Examples: hablás, subís, comés. In the %imperativo positivo%, the endings are -á, -í, and -é for regular AR, IR, and ER verbs, respectively. Examples: hablá, subí, comé. Two irregular ~vos~ %imperativo positivo% verbs are ir ($ANDÁ$) and dar ($dA$). In the following tenses, the ~vos~ endings are identical to the ~tú~ endings: %pretérito%, %imperfecto de indicativo%, %futuro de indicativo%, %condicional%, %presente de subjuntivo%, %imperfecto de subjuntivo 1%, %imperfecto de subjuntivo 2%, %futuro de subjuntivo%, and %imperativo negativo%. Compound-tense ~vos~ conjugations are identical to their ~tú~ counterparts. Certain verbs that change vowels in the ~yo~, ~tú~, ~él~, and ~ellos~ conjugations, but not in the ~nosotros~ or ~vosotros~ conjugations, do not change vowels in the ~vos~ conjugation. Examples: Tú $mUEves$. Vos movés. Yo $pIerdo$. Vos perdés. Ella $pUEde$. Vos podés. In this sense, ~vos~ conjugations are more regular than those of ~yo~, ~tú~, ~él~, and ~ellos~. See %credits% for Wikipedia and RAE attribution.
es: ^Antecedentes^ En ciertas partes de América Latina, cuando se dirigen a una persona de manera informal, los hispanohablantes usan el pronombre ~vos~ y sus conjugaciones en lugar del pronombre ~tú~ y sus conjugaciones. Este fenómeno, ~voseo~, aparece por toda Argentina y ocurre, en diversos grados, en toda América Latina, excepto en República Dominicana y Puerto Rico. Desafortunadamente, las conjugaciones de ~vos~ varían según el país y la región, lo que le complica las cosas al estudiante de español, pero la Real Academia Española (RAE), la principal autoridad del idioma español, proporciona unas conjugaciones modelo. Estas conjugaciones tienen algún valor porque un hispanohablante de Medellín, Colombia, le confirmó al desarrollador de ~Conjugar~ que las usa. Para una mayor conveniencia, ~Conjugar~ usa las conjugaciones ~vos~ de RAE. ^Conjugación^ Las conjugaciones de ~vos~ son muy parecidas a las de ~tú~ y, en menor medida, a las de ~vosotros~. En %presente de indicativo%, las terminaciones son -ás, -ís y -és para los verbos regulares terminados en AR, IR y ER, respectivamente. Ejemplos: hablás, subís, comés. En %imperativo positivo%, las terminaciones son -á, -í y -é para los verbos regulares en AR, IR y ER, respectivamente. Ejemplos: hablá, subí, comé. Hay dos verbos irregulares de ~vos~ en %imperativo positivo%: ir ($ANDÁ$) y dar ($dA$). En los siguientes tiempos, las terminaciones de ~vos~ son idénticas a las terminaciones de ~tú~: %pretérito%, %imperfecto de indicativo%, %futuro de indicativo%, %condicional%, %presente de subjuntivo%, %imperfecto de subjuntivo 1%, %imperfecto de subjuntivo 2%, %futuro de subjuntivo% e %imperativo negativo%. Las conjugaciones de ~vos~ de los tiempos compuestos son idénticas a las formas correspondientes de ~tú~. Hay ciertos verbos que cambian las vocales en las conjugaciones de ~yo~, ~tú~, ~él~ y ~ellos~, pero no en las conjugaciones de ~nosotros~ o ~vosotros~, que tampoco cambian las vocales en la conjugación de ~vos~. Ejemplos: Tú $mUEves$. Vos movés. Yo $pIerdo$. Vos perdés. Ella $pUEde$. Vos podés. En este sentido, las conjugaciones de ~vos~ son más regulares que las de ~yo~, ~tú~, ~él~ y ~ellos~. Ve a %créditos% para leer la atribución a la Wikipedia y RAE.

# Model.modelLabel %@
source: Model %@
es: Modelo %@

# Model.numberAndPercent %@ %lld
source: Model %1$@ · %2$lld%% irregular
es: Modelo %1$@ · %2$lld%% irregular

# Model.verbsUsing %lld
source: %lld verbs use this model
es: %lld verbos usan este modelo

# ModelSort.classNumber
source: Number
es: Número

# ModelSort.irregularity
source: Irregularity
es: Irregularidad

# Onboarding.aiBody
source: Conjugar uses Apple Intelligence to power a personal conjugation tutor. Ask it anything about Spanish verbs—it is grounded in the app's own engine, so it never invents forms.
es: Conjugar usa Apple Intelligence para ofrecer un tutor de conjugación personal. Pregúntale lo que quieras sobre los verbos en español: se basa en el motor de la propia app, así que nunca inventa formas.

# Onboarding.aiTitle
source: Your AI-Powered Tutor
es: Tu tutor con inteligencia artificial

# Onboarding.browseBody
source: Explore 4,811 verbs across every conjugation pattern. Tap any verb to see its full conjugation table with irregularities highlighted. Sort verbs by frequency of use for study purposes.
es: Explora 4811 verbos de todos los patrones de conjugación. Toca cualquier verbo para ver su tabla de conjugación completa con las irregularidades resaltadas. Ordena los verbos por frecuencia de uso para estudiar.

# Onboarding.browseTitle
source: Browse 4,811 Spanish Verbs
es: Explora 4811 verbos en español

# Onboarding.browseVerbsButton
source: Browse Verbs
es: Explorar verbos

# Onboarding.dismiss
source: Dismiss
es: Cerrar

# Onboarding.exploreModelsButton
source: Explore Verb Models
es: Explorar modelos

# Onboarding.gameBody
source: Conjugar has a built-in, family-friendly game called Toreo por Amor. As a plucky flamenco dancer, climb the girders to reach the bull and rescue the matador. Climb five escalating stages, dodging rolling hazards and grabbing power-ups like the smash-happy muleta (cape). Survive surprises along the way, from zombified-and-stampeding enemies to sudden blackouts. Reach the top of the final stage, and a flamenco dance-off with the bull determines whether love conquers all.
es: Conjugar tiene un juego integrado y apto para toda la familia llamado Toreo por Amor. Como una intrépida bailaora de flamenco, sube por las vigas hasta llegar al toro y rescata al matador. Sube por cinco niveles cada vez más difíciles, esquivando obstáculos y recogiendo mejoras como la muleta que destroza enemigos. Sobrevive a las sorpresas del camino, desde enemigos zombificados y en estampida hasta apagones repentinos. Llega a la cima del nivel final, y un duelo de flamenco con el toro determina si el amor todo lo vence.

# Onboarding.gameTitle
source: Play Toreo por Amor
es: Juega a Toreo por Amor

# Onboarding.getStarted
source: Get Started
es: Comenzar

# Onboarding.learnBody
source: Read in-depth treatises on every Spanish tense, illustrated with examples from Spanish-language literature—from the Cantar de mio Cid to Cervantes and García Márquez.
es: Lee tratados detallados sobre cada tiempo verbal del español, ilustrados con ejemplos de la literatura en lengua española: desde el Cantar de mio Cid hasta Cervantes y García Márquez.

# Onboarding.learnTitle
source: Deep-Dive Articles
es: Artículos a fondo

# Onboarding.meetTutorButton
source: Meet the Tutor
es: Conocer al tutor

# Onboarding.modelsBody
source: Discover the conjugation models that Spanish verbs follow. Each model captures a distinct pattern of stem changes and endings, from the regular -ar, -er, and -ir verbs to irregulars like tener and ir.
es: Descubre los modelos de conjugación que siguen los verbos en español. Cada modelo recoge un patrón distinto de cambios en la raíz y de terminaciones, desde los verbos regulares en -ar, -er e -ir hasta irregulares como tener e ir.

# Onboarding.modelsTitle
source: Explore Verb Models
es: Explora los modelos de verbos

# Onboarding.onboarding
source: Onboarding
es: Introducción

# Onboarding.playGameButton
source: Play
es: Jugar

# Onboarding.quizBody
source: Take timed quizzes, earn points, and compete on the Game Center leaderboard. Choose from three difficulty levels as your skills grow.
es: Haz cuestionarios cronometrados, gana puntos y compite en la tabla de clasificación de Game Center. Elige entre tres niveles de dificultad a medida que mejoras.

# Onboarding.quizTitle
source: Test Your Knowledge
es: Pon a prueba tus conocimientos

# Onboarding.readArticlesButton
source: Read Articles
es: Leer artículos

# Onboarding.showOnboarding
source: Show Onboarding
es: Ver introducción

# Onboarding.showOnboardingDescription
source: Revisit the welcome tour at any time.
es: Vuelve al recorrido de bienvenida cuando quieras.

# Onboarding.skip
source: Skip
es: Omitir

# Onboarding.startQuizButton
source: Take a Quiz
es: Hacer un cuestionario

# Onboarding.welcomeBody
source: Conjugar helps you learn and practice Spanish verb conjugations across every tense.
es: Conjugar te ayuda a aprender y practicar la conjugación de los verbos en español en todos los tiempos.
